In [2]:
import pandas as pd
import numpy as np

In [25]:
series = list(zip(np.arange(10), np.arange(20, 30), np.arange(30, 40)))
series

[(0, 20, 30),
 (1, 21, 31),
 (2, 22, 32),
 (3, 23, 33),
 (4, 24, 34),
 (5, 25, 35),
 (6, 26, 36),
 (7, 27, 37),
 (8, 28, 38),
 (9, 29, 39)]

In [26]:
df = pd.DataFrame(series)
df.columns = ['First', 'Second', 'Third']
df

   First  Second  Third
0      0      20     30
1      1      21     31
2      2      22     32
3      3      23     33
4      4      24     34
5      5      25     35
6      6      26     36
7      7      27     37
8      8      28     38
9      9      29     39

In [27]:
df[1:3]

   First  Second  Third
1      1      21     31
2      2      22     32

In [38]:
df[[1]][1:3]

   Second
1      21
2      22

In [39]:
df.iloc[1:3]

   First  Second  Third
1      1      21     31
2      2      22     32

In [48]:
df.iloc[5:7,1:3]

   Second  Third
5      25     35
6      26     36

In [52]:
df.iat[1, 1]

21

In [53]:
df.iloc[1, 1]

21

In [63]:
df[(df.First < 8) & (df.First > 3)][['First', 'Second']]

   First  Second
4      4      24
5      5      25
6      6      26
7      7      27

In [65]:
df

   First  Second  Third
0      0      20     30
1      1      21     31
2      2      22     32
3      3      23     33
4      4      24     34
5      5      25     35
6      6      26     36
7      7      27     37
8      8      28     38
9      9      29     39

In [67]:
df.iloc[1]

First      1
Second    21
Third     31
Name: 1, dtype: int64

In [68]:
df - df.iloc[1]

   First  Second  Third
0     -1      -1     -1
1      0       0      0
2      1       1      1
3      2       2      2
4      3       3      3
5      4       4      4
6      5       5      5
7      6       6      6
8      7       7      7
9      8       8      8

In [70]:
df.subtract(np.arange(10), axis=0)

   First  Second  Third
0      0      20     30
1      0      20     30
2      0      20     30
3      0      20     30
4      0      20     30
5      0      20     30
6      0      20     30
7      0      20     30
8      0      20     30
9      0      20     30

In [73]:
df.sub(np.arange(10), axis=0)

   First  Second  Third
0      0      20     30
1      0      20     30
2      0      20     30
3      0      20     30
4      0      20     30
5      0      20     30
6      0      20     30
7      0      20     30
8      0      20     30
9      0      20     30